In [1]:
import pandas as pd
import numpy as np
import sqlite3 

connection = sqlite3.connect('../data/vacancy.db')
cursor = connection.cursor()

def select(query):
    try:
        return pd.read_sql_query(query, connection)
    except:
        cursor.executescript(query)
        connection.commit()

In [10]:
query = r'''
    SELECT * 
    FROM vacancy
'''
select(query).head()

,id,name,premium,has_test,response_letter_required,area_id,salary_from,salary_to,salary_currency,salary_gross,type_id,metro_station_id,employer_id,published_at,schedule_id
0,10176972,Ведущий инженер-программист (Delphi),0,0,0,99,40000.0,NaN,RUR,NaN,open,None,136171.0,2021-01-13T08:21:14+0300,fullDay
1,19873107,IOS-разработчик,0,0,1,160,350000.0,1000000.0,KZT,0.0,open,None,40662.0,2020-12-28T06:52:32+0300,fullDay
2,20120535,Ведущий программист Scala / Java ( Senior Scal...,0,0,0,212,60000.0,90000.0,RUR,0.0,open,None,968814.0,2021-01-14T07:40:13+0300,fullDay
3,23473091,Java / Kotlin Developer,0,0,0,2,150000.0,NaN,RUR,0.0,open,15.215,1539356.0,2021-01-14T14:29:23+0300,flexible
4,23795691,Ведущий аналитик 1С,0,0,0,1,150000.0,NaN,RUR,0.0,open,9.142,115972.0,2021-01-11T18:45:51+0300,fullDay

In [3]:
query = r'''
    SELECT * 
    FROM vacancy
'''
select(query).info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5916 entries, 0 to 5915
Data columns (total 15 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   id                        5916 non-null   int64
 1   name                      5916 non-null   object
 2   premium                   5916 non-null   int64
 3   has_test                  5916 non-null   int64
 4   response_letter_required  5916 non-null   int64
 5   area_id                   5916 non-null   int64
 6   salary_from               5243 non-null   float64
 7   salary_to                 3445 non-null   float64
 8   salary_currency           5916 non-null   object
 9   salary_gross              5910 non-null   float64
 10  type_id                   5916 non-null   object
 11  metro_station_id          1323 non-null   object
 12  employer_id               5905 non-null   float64
 13  published_at              5916 non-null   object
 14  schedule_id               5916 non-null   object
dtypes: float64(4), int64(5), object(6)
memory usage: 693.4+ KB

In [6]:
query = r'''
    SELECT *
    FROM schedule
'''
select(query)

            id              name
0      fullDay       Полный день
1        shift    Сменный график
2     flexible     Гибкий график
3       remote  Удаленная работа
4  flyInFlyOut    Вахтовый метод

In [9]:
query = r'''
    SELECT sc.name, COUNT(*) AS count_sc
    FROM vacancy AS vc
        JOIN schedule AS sc ON vc.schedule_id = sc.id
    GROUP BY vc.schedule_id
    ORDER BY count_sc DESC
'''
select(query)

               name  count_sc
0       Полный день      4187
1  Удаленная работа      1288
2     Гибкий график       379
3    Сменный график        57
4    Вахтовый метод         5

Напишите запрос, который посчитает количество вакансий по каждой валюте. Запрос должен вернуть два столбца — название валюты на русском и количество вакансий по ней. Отсортируйте по количеству вакансий по убыванию.

In [58]:
query = r'''
    SELECT * FROM currency
'''
select(query)

  code       abbr               name        rate
0  AZN        AZN             Манаты    0.023107
1  BYR  бел. руб.  Белорусские рубли    0.034966
2  EUR        EUR               Евро    0.011138
3  GEL        GEL    Грузинский лари    0.034400
4  KGS        KGS     Киргизский сом    1.131738
5  KZT        KZT              Тенге    5.699857
6  RUR       руб.              Рубли    1.000000
7  UAH       грн.             Гривны    0.380539
8  USD        USD            Доллары    0.013601
9  UZS        сум      Узбекский сум  142.441417

In [11]:
query = r'''
    SELECT 
        cr.name AS currency_name,
        COUNT(*) AS vacancy_count
    FROM vacancy vc
        JOIN currency cr ON vc.salary_currency = cr.code
    GROUP BY vc.salary_currency
    ORDER BY vacancy_count DESC
'''
select(query).head()

       currency_name  vacancy_count
0              Рубли           5228
1            Доллары            350
2              Тенге            168
3               Евро             56
4  Белорусские рубли             56

In [13]:
query = r'''
    SELECT * FROM employer
'''
select(query).head()

    id                            name  trusted  open_vacancies
0   41                           ЮНЭКТ      1.0             1.0
1   59          РОЛЬФ, группа компаний      1.0             1.0
2   65  Московский аэропорт Домодедово      1.0             3.0
3   80                      Альфа-Банк      1.0             3.0
4  124                Coleman Services      1.0             6.0

>Кто предлагает топ-5 самых высокооплачиваемых рублевых вакансий и о чем они?

In [5]:
query = r'''
    SELECT 
         em.name as employee_name,
         vc.name AS vacancy_name,
         salary_from AS salary
    FROM vacancy vc 
        JOIN employer em ON vc.employer_id = em.id
        JOIN currency cr ON vc.salary_currency = cr.code
    WHERE cr.name = 'Рубли'
    ORDER BY salary DESC
    LIMIT 5
'''
select(query)

,employee_name,vacancy_name,salary
0,АРЕС,Senior Frontend Engineer/ Архитектор трейдинго...,400000
1,АРЕС,Senior Backend Secure Engeneer ( информационна...,400000
2,LATOKEN,Chief Technology Officer (CTO),370000
3,Знаменка Капитал,"Team Lead (#C++, #Linux, #HPC)",350000
4,Набока Олеся Андреевна,Head of Analytics,320000

для каждой компании долю вакансий с гибким графиком от общего количества вакансий этой компании. Например:

    У компании А 30 открытых вакансий, из них 15 с гибким графиком. Доля = 15/30 = 0.5
    У компании Б 10 открытых вакансий, из них 9 с гибким графиком. Доля = 9/10 = 0.9

Назовем эту долю flexible_ratio.

Напишите запрос, который вернет компании с наибольшей flexible_ratio. Учитывайте только компании, у которых 10 и более открытых вакансий. Отсортируйте по убыванию flexible_ratio. Кто на третьем месте?

In [53]:
query = r'''
    WITH get_total AS (
    SELECT 
        em.name AS company_name,
        schedule_id,
        COUNT(*) OVER w AS total
    FROM vacancy vc
        JOIN employer em ON vc.employer_id = em.id
    WINDOW w AS (
        PARTITION BY vc.employer_id
    )), get_flexible_list AS (
    SELECT
        company_name,
        schedule_id,
        COUNT(*) * 1.0/total AS flexible,
        ROW_NUMBER() OVER w AS num
    FROM get_total
    WHERE schedule_id = 'flexible' AND total >= 10
    GROUP BY company_name, schedule_id
    WINDOW w AS (
        ORDER BY COUNT(*) * 1.0/total DESC
    )
    ORDER BY flexible DESC
    )
    SELECT
        company_name
    FROM get_flexible_list
    WHERE num = 3
'''
select(query)

        company_name
0  Атом Безопасность

Самые денежные вакансии

In [63]:
query = r'''
    WITH get_ordered_salary AS (
    SELECT 
         em.name AS company_name,
         vc.salary_from / cr.rate as salary,
         ROW_NUMBER() OVER w AS rating
    FROM vacancy vc
        JOIN employer em ON em.id = vc.employer_id
        JOIN currency cr ON cr.code = vc.salary_currency
    WINDOW w AS (
        ORDER BY vc.salary_from / cr.rate DESC
    )
    ORDER BY salary DESC
    )
    SELECT company_name
    FROM get_ordered_salary
    WHERE rating = 3
'''
select(query)

  company_name
0   think-cell

## 3.2 Иерархия
>Напишите запрос, который выберет города Гомельской области Беларуси, отсортированные по алфавиту. Какой город на третьем месте?

In [64]:
query = r'''
    SELECT * FROM area
'''
select(query).head()

   id  parent_id             name
0   1      113.0           Москва
1   2      113.0  Санкт-Петербург
2   3     1261.0     Екатеринбург
3   4     1202.0      Новосибирск
4   5        NaN          Украина

In [68]:
query = r'''
    WITH get_id AS (
        SELECT
            id AS target_parent_id
        FROM area
        WHERE name LIKE 'Гомельск%'
    )
    SELECT 
        name
    FROM area, get_id
    WHERE parent_id = target_parent_id 
    ORDER BY name
'''
select(query).head()

            name
0         Брагин
1  Буда-Кошелево
2          Ветка
3         Добруш
4          Ельск

#### Группируем вакансии по областям

>Напишите запрос, который посчитает количество вакансий в каждом из регионов России. Отсортируйте по убыванию количества вакансий. Какой регион на третьем месте?

In [88]:
query = r'''
    SELECT 
        vc.name AS vacancy_name,
        ar.id AS area_id
    FROM vacancy vc 
        JOIN area ar ON vc.area_id = ar.id
    
        
'''
select(query)

                                           vacancy_name  area_id
0                  Ведущий инженер-программист (Delphi)       99
1                                       IOS-разработчик      160
2     Ведущий программист Scala / Java ( Senior Scal...      212
3                               Java / Kotlin Developer        2
4                                   Ведущий аналитик 1С        1
...                                                 ...      ...
5911                                    Бизнес-аналитик        1
5912                                  Системный инженер        1
5913                        Junior Frontend-разработчик       24
5914                                          Товаровед        1
5915                    Стажер/разработчик PHP (Bitrix)     1002

[5916 rows x 2 columns]

In [104]:
query = r'''
    SELECT 
        vc.area_id,
        CASE WHEN cr.name IS NULL THEN rg.name ELSE cr.name END AS country,
        CASE WHEN cr.name IS NULL THEN ct.name ELSE rg.name END AS region,
        COUNT(vc.name) AS vacancy_count
    FROM vacancy vc
        JOIN area ct ON vc.area_id = ct.id
        LEFT JOIN area rg ON ct.parent_id = rg.id
        LEFT JOIN area cr ON rg.parent_id = cr.id
    WHERE country = 'Россия'
    GROUP BY region
    ORDER BY vacancy_count DESC
'''
select(query)

    area_id country                           region  vacancy_count
0         1  Россия                           Москва           1782
1         2  Россия                  Санкт-Петербург            695
2        53  Россия               Краснодарский край            381
3         4  Россия            Новосибирская область            259
4      1641  Россия             Республика Татарстан            241
..      ...     ...                              ...            ...
70       51  Россия                  Республика Коми              1
71       10  Россия                 Республика Алтай              1
72        8  Россия                Республика Адыгея              1
73       44  Россия                  Камчатский край              1
74       39  Россия  Кабардино-Балкарская республика              1

[75 rows x 4 columns]

In [115]:
query = r'''
    SELECT 
        ct.name AS city,
        COUNT(st.name) AS station_count
    FROM metro ct
        LEFT JOIN metro ln ON ln.parent_id = ct.id
        LEFT JOIN metro st ON st.parent_id = ln.id
    WHERE ct.parent_id IS null
    GROUP BY city
    ORDER BY station_count DESC
'''
select(query)

                      city  station_count
0                   Москва            336
1          Санкт-Петербург             72
2                     Киев             52
3                    Минск             33
4                  Харьков             29
5          Нижний Новгород             16
6              Новосибирск             13
7                   Казань             11
8                   Самара             10
9             Екатеринбург             10
10                  Алматы              9
11  Днепр (Днепропетровск)              6